Revit 2027 API
ParameterTypeId.ViewSolarstudyIsMultidayStudyType Property
 "Multi-day study"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyIsMultidayStudyType { get; }
Public Shared ReadOnly Property ViewSolarstudyIsMultidayStudyType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyIsMultidayStudyType {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyIsMultidayStudyType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace